#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
null_resource.always_run: Refreshing state... [id=1718202053173912207]
local_file.k3s_ansible_host_cloud_config: Refreshing state... [id=726099b53168c8bf93aab0585c5f2776c3fd34f2]
null_resource.k3s_ansible_host_cloud_config_ssh_file_provisioner: Refreshing state... [id=7136294699647367389]
proxmox_vm_qemu.cloudflare-tunnel-solufit-3: Refreshing state... [id=milky-carina/qemu/2005]
proxmox_vm_qemu.k3s-manager-controller-03: Refreshing state... [id=milky-polaris/qemu/1003]
proxmox_vm_qemu.cloudflare-tunnel-solufit-2: Refreshing state... [id=milky-polaris/qemu/2004]
proxmox_vm_qemu.cloudflare-tunnel-solufit-4: Refreshing state... [id=milky-carina/qemu/2006]
proxmox_vm_qemu.k3s-manager-worker-01: Refreshing state... [id=milky-capella/qemu/1100]
proxmox_vm_qemu.k3s-manager-controller-02: Refreshing state... [id=milky-carina/qemu/1002]
proxmox_vm_qemu.k3s-manager-worker-03: Refreshing state... [id=milky-carina/qemu/1102]
proxmox_vm_qemu.cloudflare-tunnel-solufit-1: Refreshing state... [id=milky-capella/qemu/2003]
proxmox_vm_qemu.k3s-manager-ansible-host: Refreshing state... [id=milky-capella/qemu/1000]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
+/- create replacement and then destroy

Terraform will perform the following actions:

  # local_file.k3s_ansible_host_cloud_config will be created
  + resource "local_file" "k3s_ansible_host_cloud_config" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./files/ansible-host-cloud-config.yaml"
      + id                   = (known after apply)
    }

  # null_resource.always_run must be replaced
+/- resource "null_resource" "always_run" {
      ~ id       = "1718202053173912207" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "always_run" = "2024-12-28T04:00:48Z" -> (known after apply)
        }
    }

  # null_resource.k3s_ansible_host_cloud_config_ssh_file_provisioner will be replaced due to changes in replace_triggered_by
+/- resource "null_resource" "k3s_ansible_host_cloud_config_ssh_file_provisioner" {
      ~ id = "7136294699647367389" -> (known after apply)
    }

  # proxmox_vm_qemu.cloudflare-tunnel-solufit-1 will be updated in-place
  ~ resource "proxmox_vm_qemu" "cloudflare-tunnel-solufit-1" {
      + bootdisk               = "scsi0"
      - ciuser                 = "ubuntu" -> null
        id                     = "milky-capella/qemu/2003"
        name                   = "solufit-cloudflare-tunnel-1"
        tags                   = null
        # (68 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.cloudflare-tunnel-solufit-2 will be updated in-place
  ~ resource "proxmox_vm_qemu" "cloudflare-tunnel-solufit-2" {
      + bootdisk               = "scsi0"
      - ciuser                 = "ubuntu" -> null
        id                     = "milky-polaris/qemu/2004"
        name                   = "solufit-cloudflare-tunnel-2"
        tags                   = null
        # (68 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.cloudflare-tunnel-solufit-3 will be updated in-place
  ~ resource "proxmox_vm_qemu" "cloudflare-tunnel-solufit-3" {
      + bootdisk               = "scsi0"
      - ciuser                 = "ubuntu" -> null
        id                     = "milky-carina/qemu/2005"
        name                   = "solufit-cloudflare-tunnel-3"
        tags                   = null
        # (68 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.cloudflare-tunnel-solufit-4 will be updated in-place
  ~ resource "proxmox_vm_qemu" "cloudflare-tunnel-solufit-4" {
      + bootdisk               = "scsi0"
      - ciuser                 = "ubuntu" -> null
        id                     = "milky-carina/qemu/2006"
        name                   = "solufit-cloudflare-tunnel-4"
        tags                   = null
        # (68 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.k3s-manager-ansible-host will be updated in-place
  ~ resource "proxmox_vm_qemu" "k3s-manager-ansible-host" {
      + bootdisk               = "scsi0"
      - ciuser                 = "ubuntu" -> null
        id                     = "milky-capella/qemu/1000"
        name                   = "k3s-ansible-host"
        tags                   = null
        # (68 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.k3s-manager-controller-02 will be destroyed
  # (because proxmox_vm_qemu.k3s-manager-controller-02 is not in configuration)
  - resource "proxmox_vm_qemu" "k3s-manager-controller-02" {
      - additional_wait        = 5 -> null
      - agent                  = 0 -> null
      - automatic_reboot       = true -> null
      - balloon                = 0 -> null
      - bios                   = "seabios" -> null
      - boot                   = "order=scsi0" -> null
      - ciuser                 = "ubuntu" -> null
      - clone                  = "ubuntu2204-withdocker" -> null
      - clone_wait             = 10 -> null
      - cores                  = 4 -> null
      - cpu                    = "host" -> null
      - default_ipv4_address   = "10.100.0.11" -> null
      - define_connection_info = true -> null
      - desc                   = "Management Kubernetes cluster for Solufit" -> null
      - force_create           = false -> null
      - full_clone             = true -> null
      - hotplug                = "network,disk,usb" -> null
      - id                     = "milky-carina/qemu/1002" -> null
      - ipconfig0              = "ip=10.100.0.11/24" -> null
      - ipconfig1              = "ip=dhcp" -> null
      - kvm                    = true -> null
      - linked_vmid            = 0 -> null
      - memory                 = 4096 -> null
      - name                   = "solufit-k3s-controller-02" -> null
      - numa                   = false -> null
      - onboot                 = false -> null
      - os_type                = "cloud-init" -> null
      - pool                   = "solufit" -> null
      - protection             = false -> null
      - qemu_os                = "other" -> null
      - reboot_required        = false -> null
      - scsihw                 = "virtio-scsi-pci" -> null
      - skip_ipv4              = false -> null
      - skip_ipv6              = false -> null
      - sockets                = 1 -> null
      - ssh_forward_ip         = "10.100.0.11" -> null
      - ssh_host               = "10.100.0.11" -> null
      - ssh_port               = "22" -> null
      - ssh_user               = "ubuntu" -> null
      - sshkeys                = <<-EOT
            ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDHnxwb9bBqio0ljUF/PrZJ6rejcBZFegnKndwRz85p9YuijN0tI3vslgTDY9eek26WXc1CMECaSvMoMpV3CalrIELV2RoTfXZOCtxkaoJxZcBpBIWAoM77h5cVusZT0znx7a9wSW4rmqFXaEHc2BMkWNDnV1w6ykpycyTUECEOq/xYqCtgUwrfGR1/cb3XTpAPZVbaEoZPXU9JfH6TR+9uKoZF7tovmXmMUkpjUn/prVUEPYBMaMKAFedtBWL7kexdStDxArTgfOj3QG+e1DOZ1IAkmxeBKg3hkQ56ECAz25NtS0DJqAEVP4EqPmTYerlsEN1Ousiw6AVz6Pzpo4OIYrCzg83DZ4eKbMr1w7cM9d3YclRIqqDOHtGgOf55mITBCz3kgHO6Id6kU62XyEcA9rcQdixOZMMMvzCBKWCaUord0A0OjabtXPQ6BeG1LBdp2oCWd0dPhehrKUHjRVuH5DfXtUf/UkOP4ElnU70c0YkxWZTs8hC+7BybkOcGePk= yuuta@yuuta-ThinkPadE14
            
            ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQC6ahvrz1GH0KxZhCVNwxWB1WJTOGBccLXDCIECzzC2mG4anVCjeZ5kyHCSvO2smASACUOouthlXq7xDXFETE/coKVe0fSnU6ApTjMW9q4U9Bsjvcx2G4YENxbgJAaIYiA8Dw3Zw2fBQUIkhxOhXgwREK0xl98n880uzIZ3PFOUu+NvNu8SoJOiVq8vgdft2EWajADS9L1DRh8OR0CnQo/RsNdL6O4RnbPGJCHPMutLKbdsazMBzPjZ4DgqF88+rC5DaAEXPlAZ1mHriZDEOlYQoOFTSwKcaYfjJvONY9zSWYgdEY5lsrMpJWD3u9FuvyiWaNPClArcWOd4zvE1z+WWDPEfVSt+pe6eMubf9nZ1/RPsP8mugX2jOaMFdMjWN4gMk+d4i/9QbRQynlOhVWo1LwmE04QIJRw6k4TNcs6The5fdwLXvx9QWI7CwOpUxvc6CxaN109yZBc8Se0GdX4djPs97H4wYSdBX6pWoastC5ludVYXlE13zSOE76BAnes= yuuta@yuuta-ThinkPadE14
        EOT -> null
      - tablet                 = true -> null
        tags                   = null
      - target_node            = "milky-carina" -> null
      - unused_disk            = [] -> null
      - vcpus                  = 0 -> null
      - vm_state               = "running" -> null
      - vmid                   = 1002 -> null
        # (25 unchanged attributes hidden)

      - disks {
          - ide {
              - ide0 {
                  - cloudinit {
                      - storage = "local-lvm" -> null
                    }
                }
            }
          - scsi {
              - scsi0 {
                  - disk {
                      - backup               = true -> null
                      - discard              = false -> null
                      - emulatessd           = false -> null
                      - format               = "raw" -> null
                      - id                   = 0 -> null
                      - iops_r_burst         = 0 -> null
                      - iops_r_burst_length  = 0 -> null
                      - iops_r_concurrent    = 0 -> null
                      - iops_wr_burst        = 0 -> null
                      - iops_wr_burst_length = 0 -> null
                      - iops_wr_concurrent   = 0 -> null
                      - iothread             = false -> null
                      - linked_disk_id       = -1 -> null
                      - mbps_r_burst         = 0 -> null
                      - mbps_r_concurrent    = 0 -> null
                      - mbps_wr_burst        = 0 -> null
                      - mbps_wr_concurrent   = 0 -> null
                      - readonly             = false -> null
                      - replicate            = false -> null
                      - size                 = "32G" -> null
                      - storage              = "data" -> null
                        # (4 unchanged attributes hidden)
                    }
                }
            }
          - virtio {
              - virtio0 {
                  - disk {
                      - backup               = true -> null
                      - discard              = false -> null
                      - format               = "raw" -> null
                      - id                   = 0 -> null
                      - iops_r_burst         = 0 -> null
                      - iops_r_burst_length  = 0 -> null
                      - iops_r_concurrent    = 0 -> null
                      - iops_wr_burst        = 0 -> null
                      - iops_wr_burst_length = 0 -> null
                      - iops_wr_concurrent   = 0 -> null
                      - iothread             = false -> null
                      - linked_disk_id       = -1 -> null
                      - mbps_r_burst         = 0 -> null
                      - mbps_r_concurrent    = 0 -> null
                      - mbps_wr_burst        = 0 -> null
                      - mbps_wr_concurrent   = 0 -> null
                      - readonly             = false -> null
                      - replicate            = false -> null
                      - size                 = "128G" -> null
                      - storage              = "main" -> null
                        # (4 unchanged attributes hidden)
                    }
                }
            }
        }

      - network {
          - bridge    = "k3s" -> null
          - firewall  = false -> null
          - link_down = false -> null
          - macaddr   = "E2:88:2C:F0:67:7B" -> null
          - model     = "virtio" -> null
          - mtu       = 1400 -> null
          - queues    = 0 -> null
          - rate      = 0 -> null
          - tag       = -1 -> null
        }
      - network {
          - bridge    = "vmbr2" -> null
          - firewall  = false -> null
          - link_down = false -> null
          - macaddr   = "16:EA:B3:4E:57:36" -> null
          - model     = "virtio" -> null
          - mtu       = 0 -> null
          - queues    = 0 -> null
          - rate      = 0 -> null
          - tag       = -1 -> null
        }

      - smbios {
          - uuid         = "69d8bbf1-542d-411a-bcd0-7558157b7c74" -> null
            # (6 unchanged attributes hidden)
        }
    }

  # proxmox_vm_qemu.k3s-manager-controller-03 will be destroyed
  # (because proxmox_vm_qemu.k3s-manager-controller-03 is not in configuration)
  - resource "proxmox_vm_qemu" "k3s-manager-controller-03" {
      - additional_wait        = 5 -> null
      - agent                  = 0 -> null
      - automatic_reboot       = true -> null
      - balloon                = 0 -> null
      - bios                   = "seabios" -> null
      - boot                   = "order=scsi0" -> null
      - ciuser                 = "ubuntu" -> null
      - clone                  = "ubuntu2204-withdocker" -> null
      - clone_wait             = 10 -> null
      - cores                  = 4 -> null
      - cpu                    = "host" -> null
      - default_ipv4_address   = "10.100.0.12" -> null
      - define_connection_info = true -> null
      - desc                   = "Management Kubernetes cluster for Solufit" -> null
      - force_create           = false -> null
      - full_clone             = true -> null
      - hotplug                = "network,disk,usb" -> null
      - id                     = "milky-polaris/qemu/1003" -> null
      - ipconfig0              = "ip=10.100.0.12/24" -> null
      - ipconfig1              = "ip=dhcp" -> null
      - kvm                    = true -> null
      - linked_vmid            = 0 -> null
      - memory                 = 4096 -> null
      - name                   = "solufit-k3s-controller-03" -> null
      - numa                   = false -> null
      - onboot                 = false -> null
      - os_type                = "cloud-init" -> null
      - pool                   = "solufit" -> null
      - protection             = false -> null
      - qemu_os                = "other" -> null
      - reboot_required        = false -> null
      - scsihw                 = "virtio-scsi-pci" -> null
      - skip_ipv4              = false -> null
      - skip_ipv6              = false -> null
      - sockets                = 1 -> null
      - ssh_forward_ip         = "10.100.0.12" -> null
      - ssh_host               = "10.100.0.12" -> null
      - ssh_port               = "22" -> null
      - ssh_user               = "ubuntu" -> null
      - sshkeys                = <<-EOT
            ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDHnxwb9bBqio0ljUF/PrZJ6rejcBZFegnKndwRz85p9YuijN0tI3vslgTDY9eek26WXc1CMECaSvMoMpV3CalrIELV2RoTfXZOCtxkaoJxZcBpBIWAoM77h5cVusZT0znx7a9wSW4rmqFXaEHc2BMkWNDnV1w6ykpycyTUECEOq/xYqCtgUwrfGR1/cb3XTpAPZVbaEoZPXU9JfH6TR+9uKoZF7tovmXmMUkpjUn/prVUEPYBMaMKAFedtBWL7kexdStDxArTgfOj3QG+e1DOZ1IAkmxeBKg3hkQ56ECAz25NtS0DJqAEVP4EqPmTYerlsEN1Ousiw6AVz6Pzpo4OIYrCzg83DZ4eKbMr1w7cM9d3YclRIqqDOHtGgOf55mITBCz3kgHO6Id6kU62XyEcA9rcQdixOZMMMvzCBKWCaUord0A0OjabtXPQ6BeG1LBdp2oCWd0dPhehrKUHjRVuH5DfXtUf/UkOP4ElnU70c0YkxWZTs8hC+7BybkOcGePk= yuuta@yuuta-ThinkPadE14
            
            ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQC6ahvrz1GH0KxZhCVNwxWB1WJTOGBccLXDCIECzzC2mG4anVCjeZ5kyHCSvO2smASACUOouthlXq7xDXFETE/coKVe0fSnU6ApTjMW9q4U9Bsjvcx2G4YENxbgJAaIYiA8Dw3Zw2fBQUIkhxOhXgwREK0xl98n880uzIZ3PFOUu+NvNu8SoJOiVq8vgdft2EWajADS9L1DRh8OR0CnQo/RsNdL6O4RnbPGJCHPMutLKbdsazMBzPjZ4DgqF88+rC5DaAEXPlAZ1mHriZDEOlYQoOFTSwKcaYfjJvONY9zSWYgdEY5lsrMpJWD3u9FuvyiWaNPClArcWOd4zvE1z+WWDPEfVSt+pe6eMubf9nZ1/RPsP8mugX2jOaMFdMjWN4gMk+d4i/9QbRQynlOhVWo1LwmE04QIJRw6k4TNcs6The5fdwLXvx9QWI7CwOpUxvc6CxaN109yZBc8Se0GdX4djPs97H4wYSdBX6pWoastC5ludVYXlE13zSOE76BAnes= yuuta@yuuta-ThinkPadE14
        EOT -> null
      - tablet                 = true -> null
        tags                   = null
      - target_node            = "milky-polaris" -> null
      - unused_disk            = [] -> null
      - vcpus                  = 0 -> null
      - vm_state               = "running" -> null
      - vmid                   = 1003 -> null
        # (25 unchanged attributes hidden)

      - disks {
          - ide {
              - ide0 {
                  - cloudinit {
                      - storage = "local-lvm" -> null
                    }
                }
            }
          - scsi {
              - scsi0 {
                  - disk {
                      - backup               = true -> null
                      - discard              = false -> null
                      - emulatessd           = false -> null
                      - format               = "raw" -> null
                      - id                   = 0 -> null
                      - iops_r_burst         = 0 -> null
                      - iops_r_burst_length  = 0 -> null
                      - iops_r_concurrent    = 0 -> null
                      - iops_wr_burst        = 0 -> null
                      - iops_wr_burst_length = 0 -> null
                      - iops_wr_concurrent   = 0 -> null
                      - iothread             = false -> null
                      - linked_disk_id       = -1 -> null
                      - mbps_r_burst         = 0 -> null
                      - mbps_r_concurrent    = 0 -> null
                      - mbps_wr_burst        = 0 -> null
                      - mbps_wr_concurrent   = 0 -> null
                      - readonly             = false -> null
                      - replicate            = false -> null
                      - size                 = "32G" -> null
                      - storage              = "data" -> null
                        # (4 unchanged attributes hidden)
                    }
                }
            }
          - virtio {
              - virtio0 {
                  - disk {
                      - backup               = true -> null
                      - discard              = false -> null
                      - format               = "raw" -> null
                      - id                   = 0 -> null
                      - iops_r_burst         = 0 -> null
                      - iops_r_burst_length  = 0 -> null
                      - iops_r_concurrent    = 0 -> null
                      - iops_wr_burst        = 0 -> null
                      - iops_wr_burst_length = 0 -> null
                      - iops_wr_concurrent   = 0 -> null
                      - iothread             = false -> null
                      - linked_disk_id       = -1 -> null
                      - mbps_r_burst         = 0 -> null
                      - mbps_r_concurrent    = 0 -> null
                      - mbps_wr_burst        = 0 -> null
                      - mbps_wr_concurrent   = 0 -> null
                      - readonly             = false -> null
                      - replicate            = false -> null
                      - size                 = "128G" -> null
                      - storage              = "main" -> null
                        # (4 unchanged attributes hidden)
                    }
                }
            }
        }

      - network {
          - bridge    = "k3s" -> null
          - firewall  = false -> null
          - link_down = false -> null
          - macaddr   = "4E:8B:70:64:FF:26" -> null
          - model     = "virtio" -> null
          - mtu       = 1400 -> null
          - queues    = 0 -> null
          - rate      = 0 -> null
          - tag       = -1 -> null
        }
      - network {
          - bridge    = "vmbr2" -> null
          - firewall  = false -> null
          - link_down = false -> null
          - macaddr   = "DE:1B:30:6F:08:73" -> null
          - model     = "virtio" -> null
          - mtu       = 0 -> null
          - queues    = 0 -> null
          - rate      = 0 -> null
          - tag       = -1 -> null
        }

      - smbios {
          - uuid         = "23a01d30-222a-4801-a0aa-058855ed4f4d" -> null
            # (6 unchanged attributes hidden)
        }
    }

  # proxmox_vm_qemu.k3s-manager-controller-1 will be created
  + resource "proxmox_vm_qemu" "k3s-manager-controller-1" {
      + additional_wait        = 5
      + agent                  = 0
      + automatic_reboot       = true
      + balloon                = 0
      + bios                   = "seabios"
      + boot                   = "order=scsi0"
      + bootdisk               = "scsi0"
      + clone                  = "ubuntu2204-withdocker"
      + clone_wait             = 10
      + cores                  = 4
      + cpu                    = "host"
      + default_ipv4_address   = (known after apply)
      + default_ipv6_address   = (known after apply)
      + define_connection_info = true
      + desc                   = "Management Kubernetes cluster for Solufit"
      + force_create           = false
      + full_clone             = true
      + hotplug                = "network,disk,usb"
      + id                     = (known after apply)
      + ipconfig0              = "ip=10.100.0.10/24"
      + ipconfig1              = "ip=dhcp"
      + kvm                    = true
      + linked_vmid            = (known after apply)
      + memory                 = 4096
      + name                   = "solufit-k3s-controller-1"
      + nameserver             = (known after apply)
      + onboot                 = false
      + os_type                = "cloud-init"
      + pool                   = "solufit"
      + protection             = false
      + reboot_required        = (known after apply)
      + scsihw                 = "virtio-scsi-pci"
      + searchdomain           = (known after apply)
      + skip_ipv4              = false
      + skip_ipv6              = false
      + sockets                = 1
      + ssh_forward_ip         = "10.100.0.10"
      + ssh_host               = (known after apply)
      + ssh_port               = (known after apply)
      + ssh_user               = "ubuntu"
      + sshkeys                = <<-EOT
            ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDHnxwb9bBqio0ljUF/PrZJ6rejcBZFegnKndwRz85p9YuijN0tI3vslgTDY9eek26WXc1CMECaSvMoMpV3CalrIELV2RoTfXZOCtxkaoJxZcBpBIWAoM77h5cVusZT0znx7a9wSW4rmqFXaEHc2BMkWNDnV1w6ykpycyTUECEOq/xYqCtgUwrfGR1/cb3XTpAPZVbaEoZPXU9JfH6TR+9uKoZF7tovmXmMUkpjUn/prVUEPYBMaMKAFedtBWL7kexdStDxArTgfOj3QG+e1DOZ1IAkmxeBKg3hkQ56ECAz25NtS0DJqAEVP4EqPmTYerlsEN1Ousiw6AVz6Pzpo4OIYrCzg83DZ4eKbMr1w7cM9d3YclRIqqDOHtGgOf55mITBCz3kgHO6Id6kU62XyEcA9rcQdixOZMMMvzCBKWCaUord0A0OjabtXPQ6BeG1LBdp2oCWd0dPhehrKUHjRVuH5DfXtUf/UkOP4ElnU70c0YkxWZTs8hC+7BybkOcGePk= yuuta@yuuta-ThinkPadE14
            
            ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQC6ahvrz1GH0KxZhCVNwxWB1WJTOGBccLXDCIECzzC2mG4anVCjeZ5kyHCSvO2smASACUOouthlXq7xDXFETE/coKVe0fSnU6ApTjMW9q4U9Bsjvcx2G4YENxbgJAaIYiA8Dw3Zw2fBQUIkhxOhXgwREK0xl98n880uzIZ3PFOUu+NvNu8SoJOiVq8vgdft2EWajADS9L1DRh8OR0CnQo/RsNdL6O4RnbPGJCHPMutLKbdsazMBzPjZ4DgqF88+rC5DaAEXPlAZ1mHriZDEOlYQoOFTSwKcaYfjJvONY9zSWYgdEY5lsrMpJWD3u9FuvyiWaNPClArcWOd4zvE1z+WWDPEfVSt+pe6eMubf9nZ1/RPsP8mugX2jOaMFdMjWN4gMk+d4i/9QbRQynlOhVWo1LwmE04QIJRw6k4TNcs6The5fdwLXvx9QWI7CwOpUxvc6CxaN109yZBc8Se0GdX4djPs97H4wYSdBX6pWoastC5ludVYXlE13zSOE76BAnes= yuuta@yuuta-ThinkPadE14
        EOT
      + tablet                 = true
      + tags                   = (known after apply)
      + target_node            = "milky-capella"
      + unused_disk            = (known after apply)
      + vcpus                  = 0
      + vm_state               = "running"
      + vmid                   = 1001

      + disks {
          + ide {
              + ide0 {
                  + cloudinit {
                      + storage = "local-lvm"
                    }
                }
            }
          + scsi {
              + scsi0 {
                  + disk {
                      + backup               = true
                      + format               = "raw"
                      + id                   = (known after apply)
                      + iops_r_burst         = 0
                      + iops_r_burst_length  = 0
                      + iops_r_concurrent    = 0
                      + iops_wr_burst        = 0
                      + iops_wr_burst_length = 0
                      + iops_wr_concurrent   = 0
                      + linked_disk_id       = (known after apply)
                      + mbps_r_burst         = 0
                      + mbps_r_concurrent    = 0
                      + mbps_wr_burst        = 0
                      + mbps_wr_concurrent   = 0
                      + size                 = "32G"
                      + storage              = "local-lvm"
                    }
                }
            }
          + virtio {
              + virtio0 {
                  + disk {
                      + backup               = true
                      + format               = "raw"
                      + id                   = (known after apply)
                      + iops_r_burst         = 0
                      + iops_r_burst_length  = 0
                      + iops_r_concurrent    = 0
                      + iops_wr_burst        = 0
                      + iops_wr_burst_length = 0
                      + iops_wr_concurrent   = 0
                      + linked_disk_id       = (known after apply)
                      + mbps_r_burst         = 0
                      + mbps_r_concurrent    = 0
                      + mbps_wr_burst        = 0
                      + mbps_wr_concurrent   = 0
                      + size                 = "128G"
                      + storage              = "main"
                    }
                }
            }
        }

      + network {
          + bridge    = "k3s"
          + firewall  = false
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "virtio"
          + mtu       = 1400
          + queues    = (known after apply)
          + rate      = (known after apply)
          + tag       = -1
        }
      + network {
          + bridge    = "vmbr2"
          + firewall  = false
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "virtio"
          + queues    = (known after apply)
          + rate      = (known after apply)
          + tag       = -1
        }

      + smbios (known after apply)
    }

  # proxmox_vm_qemu.k3s-manager-controller-2 will be created
  + resource "proxmox_vm_qemu" "k3s-manager-controller-2" {
      + additional_wait        = 5
      + agent                  = 0
      + automatic_reboot       = true
      + balloon                = 0
      + bios                   = "seabios"
      + boot                   = "order=scsi0"
      + bootdisk               = "scsi0"
      + clone                  = "ubuntu2204-withdocker"
      + clone_wait             = 10
      + cores                  = 4
      + cpu                    = "host"
      + default_ipv4_address   = (known after apply)
      + default_ipv6_address   = (known after apply)
      + define_connection_info = true
      + desc                   = "Management Kubernetes cluster for Solufit"
      + force_create           = false
      + full_clone             = true
      + hotplug                = "network,disk,usb"
      + id                     = (known after apply)
      + ipconfig0              = "ip=10.100.0.11/24"
      + ipconfig1              = "ip=dhcp"
      + kvm                    = true
      + linked_vmid            = (known after apply)
      + memory                 = 4096
      + name                   = "solufit-k3s-controller-2"
      + nameserver             = (known after apply)
      + onboot                 = false
      + os_type                = "cloud-init"
      + pool                   = "solufit"
      + protection             = false
      + reboot_required        = (known after apply)
      + scsihw                 = "virtio-scsi-pci"
      + searchdomain           = (known after apply)
      + skip_ipv4              = false
      + skip_ipv6              = false
      + sockets                = 1
      + ssh_forward_ip         = "10.100.0.11"
      + ssh_host               = (known after apply)
      + ssh_port               = (known after apply)
      + ssh_user               = "ubuntu"
      + sshkeys                = <<-EOT
            ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDHnxwb9bBqio0ljUF/PrZJ6rejcBZFegnKndwRz85p9YuijN0tI3vslgTDY9eek26WXc1CMECaSvMoMpV3CalrIELV2RoTfXZOCtxkaoJxZcBpBIWAoM77h5cVusZT0znx7a9wSW4rmqFXaEHc2BMkWNDnV1w6ykpycyTUECEOq/xYqCtgUwrfGR1/cb3XTpAPZVbaEoZPXU9JfH6TR+9uKoZF7tovmXmMUkpjUn/prVUEPYBMaMKAFedtBWL7kexdStDxArTgfOj3QG+e1DOZ1IAkmxeBKg3hkQ56ECAz25NtS0DJqAEVP4EqPmTYerlsEN1Ousiw6AVz6Pzpo4OIYrCzg83DZ4eKbMr1w7cM9d3YclRIqqDOHtGgOf55mITBCz3kgHO6Id6kU62XyEcA9rcQdixOZMMMvzCBKWCaUord0A0OjabtXPQ6BeG1LBdp2oCWd0dPhehrKUHjRVuH5DfXtUf/UkOP4ElnU70c0YkxWZTs8hC+7BybkOcGePk= yuuta@yuuta-ThinkPadE14
            
            ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQC6ahvrz1GH0KxZhCVNwxWB1WJTOGBccLXDCIECzzC2mG4anVCjeZ5kyHCSvO2smASACUOouthlXq7xDXFETE/coKVe0fSnU6ApTjMW9q4U9Bsjvcx2G4YENxbgJAaIYiA8Dw3Zw2fBQUIkhxOhXgwREK0xl98n880uzIZ3PFOUu+NvNu8SoJOiVq8vgdft2EWajADS9L1DRh8OR0CnQo/RsNdL6O4RnbPGJCHPMutLKbdsazMBzPjZ4DgqF88+rC5DaAEXPlAZ1mHriZDEOlYQoOFTSwKcaYfjJvONY9zSWYgdEY5lsrMpJWD3u9FuvyiWaNPClArcWOd4zvE1z+WWDPEfVSt+pe6eMubf9nZ1/RPsP8mugX2jOaMFdMjWN4gMk+d4i/9QbRQynlOhVWo1LwmE04QIJRw6k4TNcs6The5fdwLXvx9QWI7CwOpUxvc6CxaN109yZBc8Se0GdX4djPs97H4wYSdBX6pWoastC5ludVYXlE13zSOE76BAnes= yuuta@yuuta-ThinkPadE14
        EOT
      + tablet                 = true
      + tags                   = (known after apply)
      + target_node            = "milky-carina"
      + unused_disk            = (known after apply)
      + vcpus                  = 0
      + vm_state               = "running"
      + vmid                   = 1002

      + disks {
          + ide {
              + ide0 {
                  + cloudinit {
                      + storage = "local-lvm"
                    }
                }
            }
          + scsi {
              + scsi0 {
                  + disk {
                      + backup               = true
                      + format               = "raw"
                      + id                   = (known after apply)
                      + iops_r_burst         = 0
                      + iops_r_burst_length  = 0
                      + iops_r_concurrent    = 0
                      + iops_wr_burst        = 0
                      + iops_wr_burst_length = 0
                      + iops_wr_concurrent   = 0
                      + linked_disk_id       = (known after apply)
                      + mbps_r_burst         = 0
                      + mbps_r_concurrent    = 0
                      + mbps_wr_burst        = 0
                      + mbps_wr_concurrent   = 0
                      + size                 = "32G"
                      + storage              = "data"
                    }
                }
            }
          + virtio {
              + virtio0 {
                  + disk {
                      + backup               = true
                      + format               = "raw"
                      + id                   = (known after apply)
                      + iops_r_burst         = 0
                      + iops_r_burst_length  = 0
                      + iops_r_concurrent    = 0
                      + iops_wr_burst        = 0
                      + iops_wr_burst_length = 0
                      + iops_wr_concurrent   = 0
                      + linked_disk_id       = (known after apply)
                      + mbps_r_burst         = 0
                      + mbps_r_concurrent    = 0
                      + mbps_wr_burst        = 0
                      + mbps_wr_concurrent   = 0
                      + size                 = "128G"
                      + storage              = "main"
                    }
                }
            }
        }

      + network {
          + bridge    = "k3s"
          + firewall  = false
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "virtio"
          + mtu       = 1400
          + queues    = (known after apply)
          + rate      = (known after apply)
          + tag       = -1
        }
      + network {
          + bridge    = "vmbr2"
          + firewall  = false
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "virtio"
          + queues    = (known after apply)
          + rate      = (known after apply)
          + tag       = -1
        }

      + smbios (known after apply)
    }

  # proxmox_vm_qemu.k3s-manager-controller-3 will be created
  + resource "proxmox_vm_qemu" "k3s-manager-controller-3" {
      + additional_wait        = 5
      + agent                  = 0
      + automatic_reboot       = true
      + balloon                = 0
      + bios                   = "seabios"
      + boot                   = "order=scsi0"
      + bootdisk               = "scsi0"
      + clone                  = "ubuntu2204-withdocker"
      + clone_wait             = 10
      + cores                  = 4
      + cpu                    = "host"
      + default_ipv4_address   = (known after apply)
      + default_ipv6_address   = (known after apply)
      + define_connection_info = true
      + desc                   = "Management Kubernetes cluster for Solufit"
      + force_create           = false
      + full_clone             = true
      + hotplug                = "network,disk,usb"
      + id                     = (known after apply)
      + ipconfig0              = "ip=10.100.0.12/24"
      + ipconfig1              = "ip=dhcp"
      + kvm                    = true
      + linked_vmid            = (known after apply)
      + memory                 = 4096
      + name                   = "solufit-k3s-controller-3"
      + nameserver             = (known after apply)
      + onboot                 = false
      + os_type                = "cloud-init"
      + pool                   = "solufit"
      + protection             = false
      + reboot_required        = (known after apply)
      + scsihw                 = "virtio-scsi-pci"
      + searchdomain           = (known after apply)
      + skip_ipv4              = false
      + skip_ipv6              = false
      + sockets                = 1
      + ssh_forward_ip         = "10.100.0.12"
      + ssh_host               = (known after apply)
      + ssh_port               = (known after apply)
      + ssh_user               = "ubuntu"
      + sshkeys                = <<-EOT
            ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDHnxwb9bBqio0ljUF/PrZJ6rejcBZFegnKndwRz85p9YuijN0tI3vslgTDY9eek26WXc1CMECaSvMoMpV3CalrIELV2RoTfXZOCtxkaoJxZcBpBIWAoM77h5cVusZT0znx7a9wSW4rmqFXaEHc2BMkWNDnV1w6ykpycyTUECEOq/xYqCtgUwrfGR1/cb3XTpAPZVbaEoZPXU9JfH6TR+9uKoZF7tovmXmMUkpjUn/prVUEPYBMaMKAFedtBWL7kexdStDxArTgfOj3QG+e1DOZ1IAkmxeBKg3hkQ56ECAz25NtS0DJqAEVP4EqPmTYerlsEN1Ousiw6AVz6Pzpo4OIYrCzg83DZ4eKbMr1w7cM9d3YclRIqqDOHtGgOf55mITBCz3kgHO6Id6kU62XyEcA9rcQdixOZMMMvzCBKWCaUord0A0OjabtXPQ6BeG1LBdp2oCWd0dPhehrKUHjRVuH5DfXtUf/UkOP4ElnU70c0YkxWZTs8hC+7BybkOcGePk= yuuta@yuuta-ThinkPadE14
            
            ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQC6ahvrz1GH0KxZhCVNwxWB1WJTOGBccLXDCIECzzC2mG4anVCjeZ5kyHCSvO2smASACUOouthlXq7xDXFETE/coKVe0fSnU6ApTjMW9q4U9Bsjvcx2G4YENxbgJAaIYiA8Dw3Zw2fBQUIkhxOhXgwREK0xl98n880uzIZ3PFOUu+NvNu8SoJOiVq8vgdft2EWajADS9L1DRh8OR0CnQo/RsNdL6O4RnbPGJCHPMutLKbdsazMBzPjZ4DgqF88+rC5DaAEXPlAZ1mHriZDEOlYQoOFTSwKcaYfjJvONY9zSWYgdEY5lsrMpJWD3u9FuvyiWaNPClArcWOd4zvE1z+WWDPEfVSt+pe6eMubf9nZ1/RPsP8mugX2jOaMFdMjWN4gMk+d4i/9QbRQynlOhVWo1LwmE04QIJRw6k4TNcs6The5fdwLXvx9QWI7CwOpUxvc6CxaN109yZBc8Se0GdX4djPs97H4wYSdBX6pWoastC5ludVYXlE13zSOE76BAnes= yuuta@yuuta-ThinkPadE14
        EOT
      + tablet                 = true
      + tags                   = (known after apply)
      + target_node            = "milky-polaris"
      + unused_disk            = (known after apply)
      + vcpus                  = 0
      + vm_state               = "running"
      + vmid                   = 1003

      + disks {
          + ide {
              + ide0 {
                  + cloudinit {
                      + storage = "local-lvm"
                    }
                }
            }
          + scsi {
              + scsi0 {
                  + disk {
                      + backup               = true
                      + format               = "raw"
                      + id                   = (known after apply)
                      + iops_r_burst         = 0
                      + iops_r_burst_length  = 0
                      + iops_r_concurrent    = 0
                      + iops_wr_burst        = 0
                      + iops_wr_burst_length = 0
                      + iops_wr_concurrent   = 0
                      + linked_disk_id       = (known after apply)
                      + mbps_r_burst         = 0
                      + mbps_r_concurrent    = 0
                      + mbps_wr_burst        = 0
                      + mbps_wr_concurrent   = 0
                      + size                 = "32G"
                      + storage              = "data"
                    }
                }
            }
          + virtio {
              + virtio0 {
                  + disk {
                      + backup               = true
                      + format               = "raw"
                      + id                   = (known after apply)
                      + iops_r_burst         = 0
                      + iops_r_burst_length  = 0
                      + iops_r_concurrent    = 0
                      + iops_wr_burst        = 0
                      + iops_wr_burst_length = 0
                      + iops_wr_concurrent   = 0
                      + linked_disk_id       = (known after apply)
                      + mbps_r_burst         = 0
                      + mbps_r_concurrent    = 0
                      + mbps_wr_burst        = 0
                      + mbps_wr_concurrent   = 0
                      + size                 = "128G"
                      + storage              = "main"
                    }
                }
            }
        }

      + network {
          + bridge    = "k3s"
          + firewall  = false
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "virtio"
          + mtu       = 1400
          + queues    = (known after apply)
          + rate      = (known after apply)
          + tag       = -1
        }
      + network {
          + bridge    = "vmbr2"
          + firewall  = false
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "virtio"
          + queues    = (known after apply)
          + rate      = (known after apply)
          + tag       = -1
        }

      + smbios (known after apply)
    }

  # proxmox_vm_qemu.k3s-manager-worker-01 will be destroyed
  # (because proxmox_vm_qemu.k3s-manager-worker-01 is not in configuration)
  - resource "proxmox_vm_qemu" "k3s-manager-worker-01" {
      - additional_wait        = 5 -> null
      - agent                  = 0 -> null
      - automatic_reboot       = true -> null
      - balloon                = 0 -> null
      - bios                   = "seabios" -> null
      - boot                   = "order=scsi0" -> null
      - ciuser                 = "ubuntu" -> null
      - clone                  = "ubuntu2204-withdocker" -> null
      - clone_wait             = 10 -> null
      - cores                  = 4 -> null
      - cpu                    = "host" -> null
      - default_ipv4_address   = "10.100.0.20" -> null
      - define_connection_info = true -> null
      - desc                   = "Management Kubernetes cluster for Solufit" -> null
      - force_create           = false -> null
      - full_clone             = true -> null
      - hotplug                = "network,disk,usb" -> null
      - id                     = "milky-capella/qemu/1100" -> null
      - ipconfig0              = "ip=10.100.0.20/24" -> null
      - ipconfig1              = "ip=dhcp" -> null
      - kvm                    = true -> null
      - linked_vmid            = 0 -> null
      - memory                 = 4096 -> null
      - name                   = "solufit-k3s-worker-01" -> null
      - numa                   = false -> null
      - onboot                 = false -> null
      - os_type                = "cloud-init" -> null
      - pool                   = "solufit" -> null
      - protection             = false -> null
      - qemu_os                = "other" -> null
      - reboot_required        = false -> null
      - scsihw                 = "virtio-scsi-pci" -> null
      - skip_ipv4              = false -> null
      - skip_ipv6              = false -> null
      - sockets                = 1 -> null
      - ssh_forward_ip         = "10.100.0.20" -> null
      - ssh_host               = "10.100.0.20" -> null
      - ssh_port               = "22" -> null
      - ssh_user               = "ubuntu" -> null
      - sshkeys                = <<-EOT
            ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDHnxwb9bBqio0ljUF/PrZJ6rejcBZFegnKndwRz85p9YuijN0tI3vslgTDY9eek26WXc1CMECaSvMoMpV3CalrIELV2RoTfXZOCtxkaoJxZcBpBIWAoM77h5cVusZT0znx7a9wSW4rmqFXaEHc2BMkWNDnV1w6ykpycyTUECEOq/xYqCtgUwrfGR1/cb3XTpAPZVbaEoZPXU9JfH6TR+9uKoZF7tovmXmMUkpjUn/prVUEPYBMaMKAFedtBWL7kexdStDxArTgfOj3QG+e1DOZ1IAkmxeBKg3hkQ56ECAz25NtS0DJqAEVP4EqPmTYerlsEN1Ousiw6AVz6Pzpo4OIYrCzg83DZ4eKbMr1w7cM9d3YclRIqqDOHtGgOf55mITBCz3kgHO6Id6kU62XyEcA9rcQdixOZMMMvzCBKWCaUord0A0OjabtXPQ6BeG1LBdp2oCWd0dPhehrKUHjRVuH5DfXtUf/UkOP4ElnU70c0YkxWZTs8hC+7BybkOcGePk= yuuta@yuuta-ThinkPadE14
            
            ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQC6ahvrz1GH0KxZhCVNwxWB1WJTOGBccLXDCIECzzC2mG4anVCjeZ5kyHCSvO2smASACUOouthlXq7xDXFETE/coKVe0fSnU6ApTjMW9q4U9Bsjvcx2G4YENxbgJAaIYiA8Dw3Zw2fBQUIkhxOhXgwREK0xl98n880uzIZ3PFOUu+NvNu8SoJOiVq8vgdft2EWajADS9L1DRh8OR0CnQo/RsNdL6O4RnbPGJCHPMutLKbdsazMBzPjZ4DgqF88+rC5DaAEXPlAZ1mHriZDEOlYQoOFTSwKcaYfjJvONY9zSWYgdEY5lsrMpJWD3u9FuvyiWaNPClArcWOd4zvE1z+WWDPEfVSt+pe6eMubf9nZ1/RPsP8mugX2jOaMFdMjWN4gMk+d4i/9QbRQynlOhVWo1LwmE04QIJRw6k4TNcs6The5fdwLXvx9QWI7CwOpUxvc6CxaN109yZBc8Se0GdX4djPs97H4wYSdBX6pWoastC5ludVYXlE13zSOE76BAnes= yuuta@yuuta-ThinkPadE14
        EOT -> null
      - tablet                 = true -> null
        tags                   = null
      - target_node            = "milky-capella" -> null
      - unused_disk            = [] -> null
      - vcpus                  = 0 -> null
      - vm_state               = "running" -> null
      - vmid                   = 1100 -> null
        # (25 unchanged attributes hidden)

      - disks {
          - ide {
              - ide0 {
                  - cloudinit {
                      - storage = "local-lvm" -> null
                    }
                }
            }
          - scsi {
              - scsi0 {
                  - disk {
                      - backup               = true -> null
                      - discard              = false -> null
                      - emulatessd           = false -> null
                      - format               = "raw" -> null
                      - id                   = 0 -> null
                      - iops_r_burst         = 0 -> null
                      - iops_r_burst_length  = 0 -> null
                      - iops_r_concurrent    = 0 -> null
                      - iops_wr_burst        = 0 -> null
                      - iops_wr_burst_length = 0 -> null
                      - iops_wr_concurrent   = 0 -> null
                      - iothread             = false -> null
                      - linked_disk_id       = -1 -> null
                      - mbps_r_burst         = 0 -> null
                      - mbps_r_concurrent    = 0 -> null
                      - mbps_wr_burst        = 0 -> null
                      - mbps_wr_concurrent   = 0 -> null
                      - readonly             = false -> null
                      - replicate            = false -> null
                      - size                 = "32G" -> null
                      - storage              = "local-lvm" -> null
                        # (4 unchanged attributes hidden)
                    }
                }
            }
          - virtio {
              - virtio0 {
                  - disk {
                      - backup               = true -> null
                      - discard              = false -> null
                      - format               = "raw" -> null
                      - id                   = 0 -> null
                      - iops_r_burst         = 0 -> null
                      - iops_r_burst_length  = 0 -> null
                      - iops_r_concurrent    = 0 -> null
                      - iops_wr_burst        = 0 -> null
                      - iops_wr_burst_length = 0 -> null
                      - iops_wr_concurrent   = 0 -> null
                      - iothread             = false -> null
                      - linked_disk_id       = -1 -> null
                      - mbps_r_burst         = 0 -> null
                      - mbps_r_concurrent    = 0 -> null
                      - mbps_wr_burst        = 0 -> null
                      - mbps_wr_concurrent   = 0 -> null
                      - readonly             = false -> null
                      - replicate            = false -> null
                      - size                 = "128G" -> null
                      - storage              = "main" -> null
                        # (4 unchanged attributes hidden)
                    }
                }
            }
        }

      - network {
          - bridge    = "k3s" -> null
          - firewall  = false -> null
          - link_down = false -> null
          - macaddr   = "E2:8E:FE:41:C1:98" -> null
          - model     = "virtio" -> null
          - mtu       = 1400 -> null
          - queues    = 0 -> null
          - rate      = 0 -> null
          - tag       = -1 -> null
        }
      - network {
          - bridge    = "vmbr2" -> null
          - firewall  = false -> null
          - link_down = false -> null
          - macaddr   = "82:69:96:CC:32:57" -> null
          - model     = "virtio" -> null
          - mtu       = 0 -> null
          - queues    = 0 -> null
          - rate      = 0 -> null
          - tag       = -1 -> null
        }

      - smbios {
          - uuid         = "810c9ff4-0040-40a7-a457-3b945a0c6161" -> null
            # (6 unchanged attributes hidden)
        }
    }

  # proxmox_vm_qemu.k3s-manager-worker-03 will be destroyed
  # (because proxmox_vm_qemu.k3s-manager-worker-03 is not in configuration)
  - resource "proxmox_vm_qemu" "k3s-manager-worker-03" {
      - additional_wait        = 5 -> null
      - agent                  = 0 -> null
      - automatic_reboot       = true -> null
      - balloon                = 0 -> null
      - bios                   = "seabios" -> null
      - boot                   = "order=scsi0" -> null
      - ciuser                 = "ubuntu" -> null
      - clone                  = "ubuntu2204-withdocker" -> null
      - clone_wait             = 10 -> null
      - cores                  = 2 -> null
      - cpu                    = "host" -> null
      - default_ipv4_address   = "10.100.0.22" -> null
      - define_connection_info = true -> null
      - desc                   = "Management Kubernetes cluster for Solufit" -> null
      - force_create           = false -> null
      - full_clone             = true -> null
      - hotplug                = "network,disk,usb" -> null
      - id                     = "milky-carina/qemu/1102" -> null
      - ipconfig0              = "ip=10.100.0.22/24" -> null
      - ipconfig1              = "ip=dhcp" -> null
      - kvm                    = true -> null
      - linked_vmid            = 0 -> null
      - memory                 = 2048 -> null
      - name                   = "solufit-k3s-worker-03" -> null
      - numa                   = false -> null
      - onboot                 = false -> null
      - os_type                = "cloud-init" -> null
      - pool                   = "solufit" -> null
      - protection             = false -> null
      - qemu_os                = "other" -> null
      - reboot_required        = false -> null
      - scsihw                 = "virtio-scsi-pci" -> null
      - skip_ipv4              = false -> null
      - skip_ipv6              = false -> null
      - sockets                = 1 -> null
      - ssh_forward_ip         = "10.100.0.22" -> null
      - ssh_host               = "10.100.0.22" -> null
      - ssh_port               = "22" -> null
      - ssh_user               = "ubuntu" -> null
      - sshkeys                = <<-EOT
            ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDHnxwb9bBqio0ljUF/PrZJ6rejcBZFegnKndwRz85p9YuijN0tI3vslgTDY9eek26WXc1CMECaSvMoMpV3CalrIELV2RoTfXZOCtxkaoJxZcBpBIWAoM77h5cVusZT0znx7a9wSW4rmqFXaEHc2BMkWNDnV1w6ykpycyTUECEOq/xYqCtgUwrfGR1/cb3XTpAPZVbaEoZPXU9JfH6TR+9uKoZF7tovmXmMUkpjUn/prVUEPYBMaMKAFedtBWL7kexdStDxArTgfOj3QG+e1DOZ1IAkmxeBKg3hkQ56ECAz25NtS0DJqAEVP4EqPmTYerlsEN1Ousiw6AVz6Pzpo4OIYrCzg83DZ4eKbMr1w7cM9d3YclRIqqDOHtGgOf55mITBCz3kgHO6Id6kU62XyEcA9rcQdixOZMMMvzCBKWCaUord0A0OjabtXPQ6BeG1LBdp2oCWd0dPhehrKUHjRVuH5DfXtUf/UkOP4ElnU70c0YkxWZTs8hC+7BybkOcGePk= yuuta@yuuta-ThinkPadE14
            
            ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQC6ahvrz1GH0KxZhCVNwxWB1WJTOGBccLXDCIECzzC2mG4anVCjeZ5kyHCSvO2smASACUOouthlXq7xDXFETE/coKVe0fSnU6ApTjMW9q4U9Bsjvcx2G4YENxbgJAaIYiA8Dw3Zw2fBQUIkhxOhXgwREK0xl98n880uzIZ3PFOUu+NvNu8SoJOiVq8vgdft2EWajADS9L1DRh8OR0CnQo/RsNdL6O4RnbPGJCHPMutLKbdsazMBzPjZ4DgqF88+rC5DaAEXPlAZ1mHriZDEOlYQoOFTSwKcaYfjJvONY9zSWYgdEY5lsrMpJWD3u9FuvyiWaNPClArcWOd4zvE1z+WWDPEfVSt+pe6eMubf9nZ1/RPsP8mugX2jOaMFdMjWN4gMk+d4i/9QbRQynlOhVWo1LwmE04QIJRw6k4TNcs6The5fdwLXvx9QWI7CwOpUxvc6CxaN109yZBc8Se0GdX4djPs97H4wYSdBX6pWoastC5ludVYXlE13zSOE76BAnes= yuuta@yuuta-ThinkPadE14
        EOT -> null
      - tablet                 = true -> null
        tags                   = null
      - target_node            = "milky-carina" -> null
      - unused_disk            = [] -> null
      - vcpus                  = 0 -> null
      - vm_state               = "running" -> null
      - vmid                   = 1102 -> null
        # (25 unchanged attributes hidden)

      - disks {
          - ide {
              - ide0 {
                  - cloudinit {
                      - storage = "local-lvm" -> null
                    }
                }
            }
          - scsi {
              - scsi0 {
                  - disk {
                      - backup               = true -> null
                      - discard              = false -> null
                      - emulatessd           = false -> null
                      - format               = "raw" -> null
                      - id                   = 0 -> null
                      - iops_r_burst         = 0 -> null
                      - iops_r_burst_length  = 0 -> null
                      - iops_r_concurrent    = 0 -> null
                      - iops_wr_burst        = 0 -> null
                      - iops_wr_burst_length = 0 -> null
                      - iops_wr_concurrent   = 0 -> null
                      - iothread             = false -> null
                      - linked_disk_id       = -1 -> null
                      - mbps_r_burst         = 0 -> null
                      - mbps_r_concurrent    = 0 -> null
                      - mbps_wr_burst        = 0 -> null
                      - mbps_wr_concurrent   = 0 -> null
                      - readonly             = false -> null
                      - replicate            = false -> null
                      - size                 = "32G" -> null
                      - storage              = "data" -> null
                        # (4 unchanged attributes hidden)
                    }
                }
            }
          - virtio {
              - virtio0 {
                  - disk {
                      - backup               = true -> null
                      - discard              = false -> null
                      - format               = "raw" -> null
                      - id                   = 0 -> null
                      - iops_r_burst         = 0 -> null
                      - iops_r_burst_length  = 0 -> null
                      - iops_r_concurrent    = 0 -> null
                      - iops_wr_burst        = 0 -> null
                      - iops_wr_burst_length = 0 -> null
                      - iops_wr_concurrent   = 0 -> null
                      - iothread             = false -> null
                      - linked_disk_id       = -1 -> null
                      - mbps_r_burst         = 0 -> null
                      - mbps_r_concurrent    = 0 -> null
                      - mbps_wr_burst        = 0 -> null
                      - mbps_wr_concurrent   = 0 -> null
                      - readonly             = false -> null
                      - replicate            = false -> null
                      - size                 = "128G" -> null
                      - storage              = "main" -> null
                        # (4 unchanged attributes hidden)
                    }
                }
            }
        }

      - network {
          - bridge    = "k3s" -> null
          - firewall  = false -> null
          - link_down = false -> null
          - macaddr   = "4E:6A:DC:4B:F8:DF" -> null
          - model     = "virtio" -> null
          - mtu       = 1400 -> null
          - queues    = 0 -> null
          - rate      = 0 -> null
          - tag       = -1 -> null
        }
      - network {
          - bridge    = "vmbr2" -> null
          - firewall  = false -> null
          - link_down = false -> null
          - macaddr   = "CE:E8:0E:7B:C7:B5" -> null
          - model     = "virtio" -> null
          - mtu       = 0 -> null
          - queues    = 0 -> null
          - rate      = 0 -> null
          - tag       = -1 -> null
        }

      - smbios {
          - uuid         = "831f4e4b-5dae-4275-be43-f44c5125b183" -> null
            # (6 unchanged attributes hidden)
        }
    }

  # proxmox_vm_qemu.k3s-manager-worker-1 will be created
  + resource "proxmox_vm_qemu" "k3s-manager-worker-1" {
      + additional_wait        = 5
      + agent                  = 0
      + automatic_reboot       = true
      + balloon                = 0
      + bios                   = "seabios"
      + boot                   = "order=scsi0"
      + bootdisk               = "scsi0"
      + clone                  = "ubuntu2204-withdocker"
      + clone_wait             = 10
      + cores                  = 4
      + cpu                    = "host"
      + default_ipv4_address   = (known after apply)
      + default_ipv6_address   = (known after apply)
      + define_connection_info = true
      + desc                   = "Management Kubernetes cluster for Solufit"
      + force_create           = false
      + full_clone             = true
      + hotplug                = "network,disk,usb"
      + id                     = (known after apply)
      + ipconfig0              = "ip=10.100.0.20/24"
      + ipconfig1              = "ip=dhcp"
      + kvm                    = true
      + linked_vmid            = (known after apply)
      + memory                 = 4096
      + name                   = "solufit-k3s-worker-1"
      + nameserver             = (known after apply)
      + onboot                 = false
      + os_type                = "cloud-init"
      + pool                   = "solufit"
      + protection             = false
      + reboot_required        = (known after apply)
      + scsihw                 = "virtio-scsi-pci"
      + searchdomain           = (known after apply)
      + skip_ipv4              = false
      + skip_ipv6              = false
      + sockets                = 1
      + ssh_forward_ip         = "10.100.0.20"
      + ssh_host               = (known after apply)
      + ssh_port               = (known after apply)
      + ssh_user               = "ubuntu"
      + sshkeys                = <<-EOT
            ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDHnxwb9bBqio0ljUF/PrZJ6rejcBZFegnKndwRz85p9YuijN0tI3vslgTDY9eek26WXc1CMECaSvMoMpV3CalrIELV2RoTfXZOCtxkaoJxZcBpBIWAoM77h5cVusZT0znx7a9wSW4rmqFXaEHc2BMkWNDnV1w6ykpycyTUECEOq/xYqCtgUwrfGR1/cb3XTpAPZVbaEoZPXU9JfH6TR+9uKoZF7tovmXmMUkpjUn/prVUEPYBMaMKAFedtBWL7kexdStDxArTgfOj3QG+e1DOZ1IAkmxeBKg3hkQ56ECAz25NtS0DJqAEVP4EqPmTYerlsEN1Ousiw6AVz6Pzpo4OIYrCzg83DZ4eKbMr1w7cM9d3YclRIqqDOHtGgOf55mITBCz3kgHO6Id6kU62XyEcA9rcQdixOZMMMvzCBKWCaUord0A0OjabtXPQ6BeG1LBdp2oCWd0dPhehrKUHjRVuH5DfXtUf/UkOP4ElnU70c0YkxWZTs8hC+7BybkOcGePk= yuuta@yuuta-ThinkPadE14
            
            ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQC6ahvrz1GH0KxZhCVNwxWB1WJTOGBccLXDCIECzzC2mG4anVCjeZ5kyHCSvO2smASACUOouthlXq7xDXFETE/coKVe0fSnU6ApTjMW9q4U9Bsjvcx2G4YENxbgJAaIYiA8Dw3Zw2fBQUIkhxOhXgwREK0xl98n880uzIZ3PFOUu+NvNu8SoJOiVq8vgdft2EWajADS9L1DRh8OR0CnQo/RsNdL6O4RnbPGJCHPMutLKbdsazMBzPjZ4DgqF88+rC5DaAEXPlAZ1mHriZDEOlYQoOFTSwKcaYfjJvONY9zSWYgdEY5lsrMpJWD3u9FuvyiWaNPClArcWOd4zvE1z+WWDPEfVSt+pe6eMubf9nZ1/RPsP8mugX2jOaMFdMjWN4gMk+d4i/9QbRQynlOhVWo1LwmE04QIJRw6k4TNcs6The5fdwLXvx9QWI7CwOpUxvc6CxaN109yZBc8Se0GdX4djPs97H4wYSdBX6pWoastC5ludVYXlE13zSOE76BAnes= yuuta@yuuta-ThinkPadE14
        EOT
      + tablet                 = true
      + tags                   = (known after apply)
      + target_node            = "milky-capella"
      + unused_disk            = (known after apply)
      + vcpus                  = 0
      + vm_state               = "running"
      + vmid                   = 1100

      + disks {
          + ide {
              + ide0 {
                  + cloudinit {
                      + storage = "local-lvm"
                    }
                }
            }
          + scsi {
              + scsi0 {
                  + disk {
                      + backup               = true
                      + format               = "raw"
                      + id                   = (known after apply)
                      + iops_r_burst         = 0
                      + iops_r_burst_length  = 0
                      + iops_r_concurrent    = 0
                      + iops_wr_burst        = 0
                      + iops_wr_burst_length = 0
                      + iops_wr_concurrent   = 0
                      + linked_disk_id       = (known after apply)
                      + mbps_r_burst         = 0
                      + mbps_r_concurrent    = 0
                      + mbps_wr_burst        = 0
                      + mbps_wr_concurrent   = 0
                      + size                 = "32G"
                      + storage              = "local-lvm"
                    }
                }
            }
          + virtio {
              + virtio0 {
                  + disk {
                      + backup               = true
                      + format               = "raw"
                      + id                   = (known after apply)
                      + iops_r_burst         = 0
                      + iops_r_burst_length  = 0
                      + iops_r_concurrent    = 0
                      + iops_wr_burst        = 0
                      + iops_wr_burst_length = 0
                      + iops_wr_concurrent   = 0
                      + linked_disk_id       = (known after apply)
                      + mbps_r_burst         = 0
                      + mbps_r_concurrent    = 0
                      + mbps_wr_burst        = 0
                      + mbps_wr_concurrent   = 0
                      + size                 = "128G"
                      + storage              = "main"
                    }
                }
            }
        }

      + network {
          + bridge    = "k3s"
          + firewall  = false
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "virtio"
          + mtu       = 1400
          + queues    = (known after apply)
          + rate      = (known after apply)
          + tag       = -1
        }
      + network {
          + bridge    = "vmbr2"
          + firewall  = false
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "virtio"
          + queues    = (known after apply)
          + rate      = (known after apply)
          + tag       = -1
        }

      + smbios (known after apply)
    }

  # proxmox_vm_qemu.k3s-manager-worker-2 will be created
  + resource "proxmox_vm_qemu" "k3s-manager-worker-2" {
      + additional_wait        = 5
      + agent                  = 0
      + automatic_reboot       = true
      + balloon                = 0
      + bios                   = "seabios"
      + boot                   = "order=scsi0"
      + bootdisk               = "scsi0"
      + clone                  = "ubuntu2204-withdocker"
      + clone_wait             = 10
      + cores                  = 2
      + cpu                    = "host"
      + default_ipv4_address   = (known after apply)
      + default_ipv6_address   = (known after apply)
      + define_connection_info = true
      + desc                   = "Management Kubernetes cluster for Solufit"
      + force_create           = false
      + full_clone             = true
      + hotplug                = "network,disk,usb"
      + id                     = (known after apply)
      + ipconfig0              = "ip=10.100.0.21/24"
      + ipconfig1              = "ip=dhcp"
      + kvm                    = true
      + linked_vmid            = (known after apply)
      + memory                 = 2048
      + name                   = "solufit-k3s-worker-2"
      + nameserver             = (known after apply)
      + onboot                 = false
      + os_type                = "cloud-init"
      + pool                   = "solufit"
      + protection             = false
      + reboot_required        = (known after apply)
      + scsihw                 = "virtio-scsi-pci"
      + searchdomain           = (known after apply)
      + skip_ipv4              = false
      + skip_ipv6              = false
      + sockets                = 1
      + ssh_forward_ip         = "10.100.0.21"
      + ssh_host               = (known after apply)
      + ssh_port               = (known after apply)
      + ssh_user               = "ubuntu"
      + sshkeys                = <<-EOT
            ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDHnxwb9bBqio0ljUF/PrZJ6rejcBZFegnKndwRz85p9YuijN0tI3vslgTDY9eek26WXc1CMECaSvMoMpV3CalrIELV2RoTfXZOCtxkaoJxZcBpBIWAoM77h5cVusZT0znx7a9wSW4rmqFXaEHc2BMkWNDnV1w6ykpycyTUECEOq/xYqCtgUwrfGR1/cb3XTpAPZVbaEoZPXU9JfH6TR+9uKoZF7tovmXmMUkpjUn/prVUEPYBMaMKAFedtBWL7kexdStDxArTgfOj3QG+e1DOZ1IAkmxeBKg3hkQ56ECAz25NtS0DJqAEVP4EqPmTYerlsEN1Ousiw6AVz6Pzpo4OIYrCzg83DZ4eKbMr1w7cM9d3YclRIqqDOHtGgOf55mITBCz3kgHO6Id6kU62XyEcA9rcQdixOZMMMvzCBKWCaUord0A0OjabtXPQ6BeG1LBdp2oCWd0dPhehrKUHjRVuH5DfXtUf/UkOP4ElnU70c0YkxWZTs8hC+7BybkOcGePk= yuuta@yuuta-ThinkPadE14
            
            ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQC6ahvrz1GH0KxZhCVNwxWB1WJTOGBccLXDCIECzzC2mG4anVCjeZ5kyHCSvO2smASACUOouthlXq7xDXFETE/coKVe0fSnU6ApTjMW9q4U9Bsjvcx2G4YENxbgJAaIYiA8Dw3Zw2fBQUIkhxOhXgwREK0xl98n880uzIZ3PFOUu+NvNu8SoJOiVq8vgdft2EWajADS9L1DRh8OR0CnQo/RsNdL6O4RnbPGJCHPMutLKbdsazMBzPjZ4DgqF88+rC5DaAEXPlAZ1mHriZDEOlYQoOFTSwKcaYfjJvONY9zSWYgdEY5lsrMpJWD3u9FuvyiWaNPClArcWOd4zvE1z+WWDPEfVSt+pe6eMubf9nZ1/RPsP8mugX2jOaMFdMjWN4gMk+d4i/9QbRQynlOhVWo1LwmE04QIJRw6k4TNcs6The5fdwLXvx9QWI7CwOpUxvc6CxaN109yZBc8Se0GdX4djPs97H4wYSdBX6pWoastC5ludVYXlE13zSOE76BAnes= yuuta@yuuta-ThinkPadE14
        EOT
      + tablet                 = true
      + tags                   = (known after apply)
      + target_node            = "milky-polaris"
      + unused_disk            = (known after apply)
      + vcpus                  = 0
      + vm_state               = "running"
      + vmid                   = 1101

      + disks {
          + ide {
              + ide0 {
                  + cloudinit {
                      + storage = "local-lvm"
                    }
                }
            }
          + scsi {
              + scsi0 {
                  + disk {
                      + backup               = true
                      + format               = "raw"
                      + id                   = (known after apply)
                      + iops_r_burst         = 0
                      + iops_r_burst_length  = 0
                      + iops_r_concurrent    = 0
                      + iops_wr_burst        = 0
                      + iops_wr_burst_length = 0
                      + iops_wr_concurrent   = 0
                      + linked_disk_id       = (known after apply)
                      + mbps_r_burst         = 0
                      + mbps_r_concurrent    = 0
                      + mbps_wr_burst        = 0
                      + mbps_wr_concurrent   = 0
                      + size                 = "32G"
                      + storage              = "data"
                    }
                }
            }
          + virtio {
              + virtio0 {
                  + disk {
                      + backup               = true
                      + format               = "raw"
                      + id                   = (known after apply)
                      + iops_r_burst         = 0
                      + iops_r_burst_length  = 0
                      + iops_r_concurrent    = 0
                      + iops_wr_burst        = 0
                      + iops_wr_burst_length = 0
                      + iops_wr_concurrent   = 0
                      + linked_disk_id       = (known after apply)
                      + mbps_r_burst         = 0
                      + mbps_r_concurrent    = 0
                      + mbps_wr_burst        = 0
                      + mbps_wr_concurrent   = 0
                      + size                 = "128G"
                      + storage              = "main"
                    }
                }
            }
        }

      + network {
          + bridge    = "k3s"
          + firewall  = false
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "virtio"
          + mtu       = 1400
          + queues    = (known after apply)
          + rate      = (known after apply)
          + tag       = -1
        }
      + network {
          + bridge    = "vmbr2"
          + firewall  = false
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "virtio"
          + queues    = (known after apply)
          + rate      = (known after apply)
          + tag       = -1
        }

      + smbios (known after apply)
    }

  # proxmox_vm_qemu.k3s-manager-worker-3 will be created
  + resource "proxmox_vm_qemu" "k3s-manager-worker-3" {
      + additional_wait        = 5
      + agent                  = 0
      + automatic_reboot       = true
      + balloon                = 0
      + bios                   = "seabios"
      + boot                   = "order=scsi0"
      + bootdisk               = "scsi0"
      + clone                  = "ubuntu2204-withdocker"
      + clone_wait             = 10
      + cores                  = 2
      + cpu                    = "host"
      + default_ipv4_address   = (known after apply)
      + default_ipv6_address   = (known after apply)
      + define_connection_info = true
      + desc                   = "Management Kubernetes cluster for Solufit"
      + force_create           = false
      + full_clone             = true
      + hotplug                = "network,disk,usb"
      + id                     = (known after apply)
      + ipconfig0              = "ip=10.100.0.22/24"
      + ipconfig1              = "ip=dhcp"
      + kvm                    = true
      + linked_vmid            = (known after apply)
      + memory                 = 2048
      + name                   = "solufit-k3s-worker-3"
      + nameserver             = (known after apply)
      + onboot                 = false
      + os_type                = "cloud-init"
      + pool                   = "solufit"
      + protection             = false
      + reboot_required        = (known after apply)
      + scsihw                 = "virtio-scsi-pci"
      + searchdomain           = (known after apply)
      + skip_ipv4              = false
      + skip_ipv6              = false
      + sockets                = 1
      + ssh_forward_ip         = "10.100.0.22"
      + ssh_host               = (known after apply)
      + ssh_port               = (known after apply)
      + ssh_user               = "ubuntu"
      + sshkeys                = <<-EOT
            ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDHnxwb9bBqio0ljUF/PrZJ6rejcBZFegnKndwRz85p9YuijN0tI3vslgTDY9eek26WXc1CMECaSvMoMpV3CalrIELV2RoTfXZOCtxkaoJxZcBpBIWAoM77h5cVusZT0znx7a9wSW4rmqFXaEHc2BMkWNDnV1w6ykpycyTUECEOq/xYqCtgUwrfGR1/cb3XTpAPZVbaEoZPXU9JfH6TR+9uKoZF7tovmXmMUkpjUn/prVUEPYBMaMKAFedtBWL7kexdStDxArTgfOj3QG+e1DOZ1IAkmxeBKg3hkQ56ECAz25NtS0DJqAEVP4EqPmTYerlsEN1Ousiw6AVz6Pzpo4OIYrCzg83DZ4eKbMr1w7cM9d3YclRIqqDOHtGgOf55mITBCz3kgHO6Id6kU62XyEcA9rcQdixOZMMMvzCBKWCaUord0A0OjabtXPQ6BeG1LBdp2oCWd0dPhehrKUHjRVuH5DfXtUf/UkOP4ElnU70c0YkxWZTs8hC+7BybkOcGePk= yuuta@yuuta-ThinkPadE14
            
            ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQC6ahvrz1GH0KxZhCVNwxWB1WJTOGBccLXDCIECzzC2mG4anVCjeZ5kyHCSvO2smASACUOouthlXq7xDXFETE/coKVe0fSnU6ApTjMW9q4U9Bsjvcx2G4YENxbgJAaIYiA8Dw3Zw2fBQUIkhxOhXgwREK0xl98n880uzIZ3PFOUu+NvNu8SoJOiVq8vgdft2EWajADS9L1DRh8OR0CnQo/RsNdL6O4RnbPGJCHPMutLKbdsazMBzPjZ4DgqF88+rC5DaAEXPlAZ1mHriZDEOlYQoOFTSwKcaYfjJvONY9zSWYgdEY5lsrMpJWD3u9FuvyiWaNPClArcWOd4zvE1z+WWDPEfVSt+pe6eMubf9nZ1/RPsP8mugX2jOaMFdMjWN4gMk+d4i/9QbRQynlOhVWo1LwmE04QIJRw6k4TNcs6The5fdwLXvx9QWI7CwOpUxvc6CxaN109yZBc8Se0GdX4djPs97H4wYSdBX6pWoastC5ludVYXlE13zSOE76BAnes= yuuta@yuuta-ThinkPadE14
        EOT
      + tablet                 = true
      + tags                   = (known after apply)
      + target_node            = "milky-carina"
      + unused_disk            = (known after apply)
      + vcpus                  = 0
      + vm_state               = "running"
      + vmid                   = 1102

      + disks {
          + ide {
              + ide0 {
                  + cloudinit {
                      + storage = "local-lvm"
                    }
                }
            }
          + scsi {
              + scsi0 {
                  + disk {
                      + backup               = true
                      + format               = "raw"
                      + id                   = (known after apply)
                      + iops_r_burst         = 0
                      + iops_r_burst_length  = 0
                      + iops_r_concurrent    = 0
                      + iops_wr_burst        = 0
                      + iops_wr_burst_length = 0
                      + iops_wr_concurrent   = 0
                      + linked_disk_id       = (known after apply)
                      + mbps_r_burst         = 0
                      + mbps_r_concurrent    = 0
                      + mbps_wr_burst        = 0
                      + mbps_wr_concurrent   = 0
                      + size                 = "32G"
                      + storage              = "data"
                    }
                }
            }
          + virtio {
              + virtio0 {
                  + disk {
                      + backup               = true
                      + format               = "raw"
                      + id                   = (known after apply)
                      + iops_r_burst         = 0
                      + iops_r_burst_length  = 0
                      + iops_r_concurrent    = 0
                      + iops_wr_burst        = 0
                      + iops_wr_burst_length = 0
                      + iops_wr_concurrent   = 0
                      + linked_disk_id       = (known after apply)
                      + mbps_r_burst         = 0
                      + mbps_r_concurrent    = 0
                      + mbps_wr_burst        = 0
                      + mbps_wr_concurrent   = 0
                      + size                 = "128G"
                      + storage              = "main"
                    }
                }
            }
        }

      + network {
          + bridge    = "k3s"
          + firewall  = false
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "virtio"
          + mtu       = 1400
          + queues    = (known after apply)
          + rate      = (known after apply)
          + tag       = -1
        }
      + network {
          + bridge    = "vmbr2"
          + firewall  = false
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "virtio"
          + queues    = (known after apply)
          + rate      = (known after apply)
          + tag       = -1
        }

      + smbios (known after apply)
    }

Plan: 9 to add, 5 to change, 6 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>


*Pushed by: @Walkmana-25, Action: `pull_request`*